# Roughness Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PipePressureDropData..::..Roughness Property
PipePressureDropData Class See Also
---
The roughness of the pipe. Units: (ft).
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public double Roughness { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Roughness As Double
	Get
```

Visual C++
---
```text
public:
property double Roughness {
	double get ();
}
```

# See Also
PipePressureDropData Class
Autodesk.Revit.DB.Plumbing Namespace